In [2]:
import pandas as pd
pd?

In [3]:
#series

In [4]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [5]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [6]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
data[1]

0.5

In [22]:
data[1:3]

b    0.50
c    0.75
dtype: float64

In [15]:
data[2:]

2    0.75
3    1.00
dtype: float64

In [16]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [19]:
data['b'] # also you can use not ordered indexes

0.5

In [28]:
population_dict = {'California': 38332521, 'Texas': 26448193, 
                   'New York': 19651127,'Illinois': 12882135, 'Florida': 19552860}
population = pd.Series(population_dict)
population

California    38332521
Texas         26448193
New York      19651127
Illinois      12882135
Florida       19552860
dtype: int64

In [25]:
population['Texas':'Illinois']

Texas       26448193
New York    19651127
Illinois    12882135
dtype: int64

In [39]:
# you can create Series without indexes
pd.Series([2, 5, 6])

0    2
1    5
2    6
dtype: int64

In [27]:
# also you can create vectorize Series, where data is one value, but vector have many indexes
pd.Series(5, index=[100, 200, 300])

100    5
200    5
300    5
dtype: int64

In [43]:
pd.Series({2:'b', 1:'a', 3:'c'})

2    b
1    a
3    c
dtype: object

In [44]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2]) # you can border of creating values

3    c
2    a
dtype: object

In [45]:
# dataframe

In [47]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297, 'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [50]:
states = pd.DataFrame({'population': population, 'area': area})
states

            population    area
California    38332521  423967
Florida       19552860  170312
Illinois      12882135  149995
New York      19651127  141297
Texas         26448193  695662

In [51]:
states.index # like a rownames in R

Index(['California', 'Florida', 'Illinois', 'New York', 'Texas'], dtype='object')

In [52]:
states.columns # like a colnames in R

Index(['population', 'area'], dtype='object')

In [55]:
states['population']

California    38332521
Florida       19552860
Illinois      12882135
New York      19651127
Texas         26448193
Name: population, dtype: int64

In [70]:
states[2:]

          population    area
Illinois    12882135  149995
New York    19651127  141297
Texas       26448193  695662

In [73]:
pd.DataFrame(population, columns=['population']) # you can create dataframe from series

            population
California    38332521
Texas         26448193
New York      19651127
Illinois      12882135
Florida       19552860

In [76]:
# from dict
data = [{'a': i, 'b': 2 * i} for i in range(3)] # keys are columns, values are values
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

In [77]:
# missed values will be NA, in pandas NaN
pd.DataFrame([{'a': 1, 'b': 2}, {'b': 3, 'c': 4}])

     a  b    c
0  1.0  2  NaN
1  NaN  3  4.0

In [97]:
# from numpy
import numpy as np
data = pd.DataFrame(np.random.rand(3, 2), columns=['foo', 'bar'], index=['a', 'b', 'c'])

In [82]:
# index structure

In [83]:
ind = pd.Index([2, 3, 5, 7, 11])
ind

Int64Index([2, 3, 5, 7, 11], dtype='int64')

In [85]:
ind[3] = 5 # Index is not mutable

TypeError: Index does not support mutable operations

In [86]:
print(ind.size, ind.shape, ind.ndim, ind.dtype)

5 (5,) 1 int64

In [92]:
indA = pd.Index([1, 3, 5, 7, 9])
indB = pd.Index([2, 3, 5, 7, 11])
indA & indB

Int64Index([3, 5, 7], dtype='int64')

In [93]:
indA ^ indB # all values, which not including into the both arrays

Int64Index([1, 2, 9, 11], dtype='int64')

In [98]:
data

        foo       bar
a  0.917283  0.863793
b  0.639663  0.511569
c  0.063373  0.288375

In [99]:
'a' in data

False

In [100]:
data = pd.Series([0.25, 0.5, 0.75, 1.0], index=['a', 'b', 'c', 'd'])

In [101]:
data['b']

0.5

In [102]:
'a' in data

True

In [103]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

In [104]:
# you can increase your Series, when use indexes, which not exist
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [105]:
data['e'] = 1.25

In [106]:
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

In [107]:
data['a':'c'] # here last element is include

a    0.25
b    0.50
c    0.75
dtype: float64

In [113]:
data[0:2] #the same for Series, but last element not include!

a    0.25
b    0.50
dtype: float64

In [111]:
data[(data > 0.3) & (data < 0.7)] # parenthesises are necessarily

b    0.5
dtype: float64

In [112]:
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

In [114]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])

In [124]:
data[1]

'a'

In [134]:
data[1:2] # this method use indexes, which we declared

3    b
dtype: object

In [133]:
data.loc[1:2] # and this method use indexes, which we declared

1    a
dtype: object

In [125]:
data.loc[1]

'a'

In [126]:
data.iloc[1] #this method use indexes, which we are not declared

'b'

In [132]:
data.iloc[1:2] # but for series is the same, as without loc

3    b
dtype: object

In [135]:
area = pd.Series({'California': 423967, 'Texas': 695662,'New York': 141297, 'Florida': 170312,'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127, 'Florida': 19552860, 'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [136]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [137]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [139]:
#but [] indexes are better, because 
data.pop == data['pop'] # accidentally you can include embedded names of methods

California    False
Texas         False
New York      False
Florida       False
Illinois      False
Name: pop, dtype: bool

In [140]:
# you can create not exsiting columns
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [141]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

In [142]:
data.T # this is transpose

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

In [143]:
data.values[0] # this is row

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

In [144]:
data['area'] #this is col

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [146]:
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

In [152]:
# better use loc, iloc and ix
data.iloc[:3, :2] # until 3 row and until 2 col. important! 0 column is indexes. for numbers

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [157]:
data.loc[:'Florida', :'pop'] # for names

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860

In [158]:
# for names and numbers
data.ix[:'New York', 2:] 

# but it was deprecated .loc if you want to label index.iloc if you want to positionally index.

/Users/sergeymong/PycharmProjects/ML Introduction Coursera/venv/lib/python3.6/site-packages/ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated

               density
California   90.413926
Texas        38.018740
New York    139.076746

In [159]:
data.loc[data['density'] > 100, ['pop', 'area']]

               pop    area
New York  19651127  141297
Florida   19552860  170312

In [160]:
data['Florida':'Illinois']

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [162]:
data[3:5] # if you create slice, you can use index slicing

            area       pop     density
Florida   170312  19552860  114.806121
Illinois  149995  12882135   85.883763

In [163]:
# masking works by row
data[data['density'] > 100]

            area       pop     density
New York  141297  19651127  139.076746
Florida   170312  19552860  114.806121

In [167]:
rng = np.random.RandomState(42) # Random State like a random.seed
ser = pd.Series(rng.randint(0, 10, 4))
ser

0    6
1    3
2    7
3    4
dtype: int64

In [169]:
df = pd.DataFrame(rng.randint(0, 10, (3, 4)), columns=['A', 'B', 'C', 'D'])
df

   A  B  C  D
0  1  7  5  1
1  4  0  9  5
2  8  0  9  2

In [170]:
np.exp(ser)

0     403.428793
1      20.085537
2    1096.633158
3      54.598150
dtype: float64

In [171]:
np.sin(df * np.pi / 4)

              A         B         C         D
0  7.071068e-01 -0.707107 -0.707107  0.707107
1  1.224647e-16  0.000000  0.707107 -0.707107
2 -2.449294e-16  0.000000  0.707107  1.000000

In [172]:
area = pd.Series({'Alaska': 1723337, 'Texas': 695662, 'California': 423967}, name='area')
population = pd.Series({'California': 38332521, 'Texas': 26448193, 'New York': 19651127}, name='population')
population / area # indexes from different massives are merged automaticly. if no data, then this will be NAN

Alaska              NaN
California    90.413926
New York            NaN
Texas         38.018740
dtype: float64

In [175]:
area.index | population.index

Index(['Alaska', 'California', 'New York', 'Texas'], dtype='object')

In [176]:
A = pd.Series([2, 4, 6], index=[0, 1, 2])
B = pd.Series([1, 3, 5], index=[1, 2, 3])
A + B

0    NaN
1    5.0
2    9.0
3    NaN
dtype: float64

In [177]:
# if you don't want NA, you can use analogue: add
A.add(B, fill_value=0)

0    2.0
1    5.0
2    9.0
3    5.0
dtype: float64

In [179]:
# also merging not only rows, but a cols
A = pd.DataFrame(rng.randint(0, 20, (2, 2)), columns=list('AB'))
A

    A  B
0  18  6
1   8  6

In [181]:
B = pd.DataFrame(rng.randint(0, 10, (3, 3)), columns=list('BAC'))
B

   B  A  C
0  3  6  7
1  2  0  3
2  1  7  3

In [182]:
A + B

      A    B   C
0  24.0  9.0 NaN
1   8.0  8.0 NaN
2   NaN  NaN NaN

In [192]:
fill = A.stack().mean()
fill

9.5

In [193]:
A.add(B, fill_value=fill)

      A     B     C
0  24.0   9.0  16.5
1   8.0   8.0  12.5
2  16.5  10.5  12.5

In [195]:
A = rng.randint(10, size=(3,4))
A

array([[6, 8, 7, 4],
       [1, 4, 7, 9],
       [8, 8, 0, 8]])

In [199]:
A - A[0] # substracting one row from dataframe happens for each row

array([[ 0,  0,  0,  0],
       [-5, -4,  0,  5],
       [ 2,  0, -7,  4]])